blog/2015-04-22-[調査]jvmのスタックサイズについて.org
#+TITLE: [調査]JVMのスタックサイズについて
#+DATE: 2015-04-22
#+SETUPFILE: ~/.emacs.d/blogs/octopress/setupfile.org
#+JEKYLL_LAYOUT: post
#+JEKYLL_CATEGORIES: java
#+JEKYLL_TAGS: jvm stack
#+JEKYLL_COMMENTS: true
#+JEKYLL_PUBLISHED: true

* 環境
本記事の内容は以下環境を前提としています。
- GNU/Linux x86_64
- OpenJDK 64-Bit 1.7.0_xx

* JVMのスタック領域について
=-Xss= 、 =-XX:ThreadStackSize= パラメータ値と =ulimit -s= リソースリミット制限値を混
乱している記事を見受けたため、HotSpotの中身を調べることにしました。

結論を先に、
- =ulimit -s= の値は親プロセスであるJVMランチャーのみスタックサイズ制限を受ける。
- JVMランチャー、JavaAPIから起動されたJavaスレッドのスタックサイズは
  =-XX:ThreadStackSize= パラメータ値が適用される。
- JVMランチャーから起動されたイニシャルスレッドのスタックサイズは =-Xss= パラメータの
  み制御できる。
- JNI経由で外部からJVMにアタッチしたスレッドのスタックサイズはJVMの管理対象外です。

{{{more}}}

JVMスタックに関して、公式のJVMスペックドキュメントは以下のように記載されたいます。

Java SE 7 Virtual Machine Specification の [[http://docs.oracle.com/javase/specs/jvms/se7/html/jvms-2.html#jvms-2.5.2][2.5.2. Java Virtual Machine Stacks]] より
#+begin_example
Each Java Virtual Machine thread has a private Java Virtual Machine stack, created at
the same time as the thread. A Java Virtual Machine stack stores frames (§2.6). A
Java Virtual Machine stack is analogous to the stack of a conventional language such
as C: it holds local variables and partial results, and plays a part in method
invocation and return. Because the Java Virtual Machine stack is never manipulated
directly except to push and pop frames, frames may be heap allocated. The memory for
a Java Virtual Machine stack does not need to be contiguous.
#+end_example
※メモ： VMスタック内のFrameはヒープ上に配置されるかも知れない。

Java SE 7 Virtual Machine Specification の [[http://docs.oracle.com/javase/specs/jvms/se7/html/jvms-2.html#jvms-2.5.6][2.5.6. Native Method Stacks]] より
#+begin_example
An implementation of the Java Virtual Machine may use conventional stacks,
colloquially called "C stacks," to support native methods (methods written in a
language other than the Java programming language). Native method stacks may also be
used by the implementation of an interpreter for the Java Virtual Machine's
instruction set in a language such as C. Java Virtual Machine implementations that
cannot load native methods and that do not themselves rely on conventional stacks
need not supply native method stacks. If supplied, native method stacks are typically
allocated per thread when each thread is created.
#+end_example

仕様上ではJVMに =Java Stack= と =Native Stack= ２種類のスタックメモリが定義されています。

- =Java Stack= ：Javaコード部分実行時に使われる領域
- =Native Stack= ：はJNIライブラリを利用時に使われる領域

以下は、JVMのメモリ論理構成イメージです。
#+begin_example
+----------------+--------------+-------------+------------------------------------------------------+
|                |              |             |  +-----------------+  +----------+  +-------------+  |
|     Heap       |  NonHeap     | Code Cache  |  | Program Counter |  |JavaStack |  |Native Stack |  |
|                |              |             |  +-----------------+  |          |  |             |  |
+----------------+--------------+-------------+                       +----------+  +-------------+  |
                                              |                       | Frame #2 |  |             |  |
                                              |                       +----------+  +-------------+  |
                                              |  << Thread >>         | Frame #1 |  |             |  |
                                              |                       +----------+  +-------------+  |
                                              +------------------------------------------------------+
#+end_example
=図1=

=Java Stack= と =Native Stack= がスレッド毎に領域が確保されいます。

Troubleshooting Guide for HotSpot VM の [[https://docs.oracle.com/javase/7/docs/webnotes/tsg/TSG-VM/html/crashes.html#gbyzz][4.1.3 Crash due to Stack Overflow]] 記述によ
るとHotSpotの実装上 =Java Stack= と =Native Stack= が同じスタック領域を共有するのようだ。

#+begin_example
In the HotSpot implementation, Java methods share stack frames with C/C++ native
code, namely user native code and the virtual machine itself. Java methods generate
code that checks that stack space is available a fixed distance towards the end of
the stack so that the native code can be called without exceeding the stack
space. This distance towards the end of the stack is called “Shadow Pages.” The
size of the shadow pages is between 3 and 20 pages, depending on the platform. This
distance is tunable, so that applications with native code needing more than the
default distance can increase the shadow page size. The option to increase shadow
pages is -XX:StackShadowPages=n, where n is greater than the default stack shadow
pages for the platform.
#+end_example

