blog/2015-04-22-[調査]jvmのスタックサイズについて.org
* Javaスレッドのスタックページ構成
HotSpotの実装から見るとJVMから起動されたJavaスレッドのスタックページは次の形で構成さ
れると思います。VM内部スレッドやJITコンパイルスレッドのページ構成はまだ別です。
#+begin_example
   --+--                         +------------------------+
     |                          /|                        |\
     |                         / |    StackRedPages       | -XX:StackRedPages=1(4Kb)
     |                        /  |                        |/
     |   HotSpot Guard Pages--   +------------------------+
     |                        \  |                        |\
     |                         \ |    StackYellowPages    | -XX:StackYellowPages=2(8Kb)
     |                          \|                        |/
     |                           +------------------------+
     |                          /|                        |\ ★Native Stackはここです★
-XX:ThreadStackSize            / |    StackShadowPages    | -XX:StackShadowPages=20(80Kb)
-XX:CompilerThreadStackSize   /  |                        |/
-XX:VMThreadStackSize        /   +------------------------+
     |                      /    |                        |
     |                     /     |   +----------------+   |
     |       Normal Stack--      |   |     Frame      |   | ★Java Stackはここです★
     |                     \     |   +----------------+   |
     |                      \    |   |     Frame      |   |
     |                       \   |   +----------------+   |
     |                        \  |   |     Frame      |   |
     |                         \ |   +----------------+   |
     |                          \|                        |
   --+--                         +------------------------+
#+end_example
=図2=

* HotSpotの実装
以下はHotSpotのソースコードのコメントに書かれたスタックページ構成図です。

[[http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#l668][jdk7:hotspot/src/os_cpu/linux_x86/vm/os_linux_x86.cpp]]
#+begin_example
// Java thread:
//
//   Low memory addresses
//    +------------------------+
//    |                        |\  JavaThread created by VM does not have glibc
//    |    glibc guard page    | - guard, attached Java thread usually has
//    |                        |/  1 page glibc guard.
// P1 +------------------------+ Thread::stack_base() - Thread::stack_size()
//    |                        |\
//    |  HotSpot Guard Pages   | - red and yellow pages
//    |                        |/
//    +------------------------+ JavaThread::stack_yellow_zone_base()
//    |                        |\
//    |      Normal Stack      | -
//    |                        |/
// P2 +------------------------+ Thread::stack_base()
//
// Non-Java thread:
//
//   Low memory addresses
//    +------------------------+
//    |                        |\
//    |  glibc guard page      | - usually 1 page
//    |                        |/
// P1 +------------------------+ Thread::stack_base() - Thread::stack_size()
//    |                        |\
//    |      Normal Stack      | -
//    |                        |/
// P2 +------------------------+ Thread::stack_base()
//
// ** P1 (aka bottom) and size ( P2 = P1 - size) are the address and stack size returned from
//    pthread_attr_getstack()
#+end_example
=図3=

図の内容によるとJavaスレッドと非Javaスレッドのスタックページ構成が若干異なる。
以下はJVMの非Javaスレッドのリストです。
|--------------------------+---------------------------------------------------------------------|
| VM thread                | JVM自身のコアスレッド                                               |
| Periodic task thread     | WatcherThreadのシングルトンインスタンス、定義的なVMタスクを実行する |
| GC threads               | その名の通りです、メモリ管理自動化役を務める                        |
| Compiler threads         | ByteCodeからアセンブラにコンパイルするスレッド                      |
| Signal dispatcher thread | 外部からシグナルをハンドリングする役を務める                        |
|--------------------------+---------------------------------------------------------------------|

** glibc guard page
=glibc guard page= はスタックポインタのオーバーフローを防ぐためのものです。Javaスレッ
ドには =HotSpot Guard Pages= が別途用意されているため、この領域のサイズが0である。非
Javaスレッドのスタック頂上位置には1ページ分が割り当てられる。以下はその実装内容です。

- [[http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/os/linux/vm/os_linux.cpp#l923][pthread_attr_setguardsize(&attr, os::Linux::default_guard_size(thr_type));]]
- [[http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#l662][os::Linux::default_guard_size(thr_type)]]

#+begin_src c++
size_t os::Linux::default_guard_size(os::ThreadType thr_type) {
  // Creating guard page is very expensive. Java thread has HotSpot
  // guard page, only enable glibc guard page for non-Java threads.
  return (thr_type == java_thread ? 0 : page_size());
}
#+end_src

=glibc guard page= に関して以下の情報が参考になると思います。
- スタックガードの大きさの設定
- [[http://linuxjm.sourceforge.jp/html/LDP_man-pages/man3/pthread_attr_setguardsize.3.html][PTHREAD_ATTR_SETGUARDSIZE]]
- [[http://codezine.jp/article/detail/1970][pthreadについて（スタックサイズ）]]
- [[http://www.nminoru.jp/~nminoru/programming/stackoverflow_handling.html#get-stack-region][スタックオーバーフローのハンドリング (Stack Overflow Handling)]]

