blog/2015-04-22-[調査]jvmのスタックサイズについて.html

<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> HotSpot Guard Pages</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Javaスレッドスタックオーバーフローを検出するために書き込み不可の <code>HotSpot Guard
Pages</code> ページがスタック領域のトップ位置に設けている。また <code>HotSpot Guard Pages</code> は
<code>StackYellowPages</code> と <code>StackRedPages</code> から構成されている。
</p>

<p>
<code>StackYellowPages</code> はスタックポインタのスタックオーバーフローの緩衝域として、余分のメ
モリーを割り当てます。 <code>StackRedPages</code> まで行くとStackOverflowErrorが起きる。
</p>

<p>
以下は構成イメージです。
</p>
<pre class="example">
          +------------------------+
         /|                        |\
HotSpot / |    StackRedPages       | - 1ページ (4Kb)
Guard  /  |                        |/
Pages     +------------------------+
       \  |                        |\
        \ |    StackYellowPages    | - 2ページ (8Kb)
         \|                        |/
          +------------------------+
          |                        |
          |      Normal Stack      |
          |                        |
          +------------------------+
</pre>
<p>
<code>図4</code>
</p>

<p>
Linux/x86_64環境に置いて、 <code>StackYellowPages</code> と <code>StackRedPages</code> の初期値が2と1である。
<code>-XX:StackYellowPages</code> と <code>-XX:StackRedPages</code> パラメータで変更することが可能である。
</p>

<p>
下記は <code>HotSpot Guard Pages</code> の割当処理ロジックです。
</p>

<p>
<a href="http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/share/vm/runtime/thread.cpp#l2257">jdk7:openjdk/hotspot/src/share/vm/runtime/thread.cpp</a>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #465457;">// </span><span style="color: #465457;">&#9733;Java&#12473;&#12524;&#12483;&#12489;&#36215;&#21205;&#26178;&#12398;&#12460;&#12540;&#12489;&#12506;&#12540;&#12472;&#12469;&#12452;&#12474;&#20301;&#32622;&#12420;&#12469;&#12452;&#12474;&#12398;&#35336;&#31639;&#20966;&#29702;</span>
<span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #ae81ff;">JavaThread</span>::<span style="color: #a6e22e;">create_stack_guard_pages</span>() {
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #960050;">!</span> <span style="color: #ae81ff;">os</span>::uses_stack_guard_pages() || _stack_guard_state != stack_guard_unused) <span style="color: #f92672; font-weight: bold;">return</span>;

  <span style="color: #465457;">// </span><span style="color: #465457;">&#9733; &#12460;&#12540;&#12489;&#12506;&#12540;&#12472;&#12398;&#20301;&#32622;&#12392;&#12469;&#12452;&#12474;&#12398;&#35336;&#31639;</span>
  <span style="color: #66d9ef; font-weight: bold;">address</span> <span style="color: #fd971f;">low_addr</span> = stack_base() - stack_size();
  <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">len</span> = (StackYellowPages + StackRedPages) * <span style="color: #ae81ff;">os</span>::vm_page_size();

  <span style="color: #465457;">// </span><span style="color: #465457;">&#9733; &#12460;&#12540;&#12489;&#12506;&#12540;&#12472;&#21106;&#24403;&#20966;&#29702;&#12399;&#12503;&#12521;&#12483;&#12488;&#12501;&#12457;&#12540;&#12512;&#20381;&#23384;&#12398;&#12383;&#12417;&#12289;&#21029;&#38306;&#25968;&#12434;&#12467;&#12540;&#12523;</span>
  <span style="color: #66d9ef; font-weight: bold;">int</span> <span style="color: #fd971f;">allocate</span> = <span style="color: #ae81ff;">os</span>::allocate_stack_guard_pages();
  <span style="color: #465457;">// </span><span style="color: #465457;">warning("Guarding at " PTR_FORMAT " for len " SIZE_FORMAT "\n", low_addr, len);</span>

  <span style="color: #f92672; font-weight: bold;">if</span> (allocate &amp;&amp; <span style="color: #960050;">!</span><span style="color: #ae81ff;">os</span>::create_stack_guard_pages((<span style="color: #66d9ef; font-weight: bold;">char</span> *) low_addr, len)) {
    warning(<span style="color: #e6db74;">"Attempt to allocate stack guard pages failed."</span>);
    <span style="color: #f92672; font-weight: bold;">return</span>;
  }

  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #ae81ff;">os</span>::guard_memory((<span style="color: #66d9ef; font-weight: bold;">char</span> *) low_addr, len)) {
    _stack_guard_state = stack_guard_enabled;
  } <span style="color: #f92672; font-weight: bold;">else</span> {
    warning(<span style="color: #e6db74;">"Attempt to protect stack guard pages failed."</span>);
    <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #ae81ff;">os</span>::uncommit_memory((<span style="color: #66d9ef; font-weight: bold;">char</span> *) low_addr, len)) {
      warning(<span style="color: #e6db74;">"Attempt to deallocate stack guard pages failed."</span>);
    }
  }
}
</pre>
</div>

<p>
<a href="http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l3062">jdk7u60:openjdk/hotspot/src/os/linux/vm/os_linux.cpp</a>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #465457;">// </span><span style="color: #465457;">&#9733;Linuxu&#23554;&#29992;&#12398;&#12460;&#12540;&#12489;&#12506;&#12540;&#12472;&#21106;&#24403;&#20966;&#29702;</span>
<span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #ae81ff;">os</span>::<span style="color: #a6e22e;">pd_create_stack_guard_pages</span>(<span style="color: #66d9ef; font-weight: bold;">char</span>* <span style="color: #fd971f;">addr</span>, <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">size</span>) {

  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::is_initial_thread()) {
    <span style="color: #465457;">// </span><span style="color: #465457;">As we manually grow stack up to bottom inside create_attached_thread(),</span>
    <span style="color: #465457;">// </span><span style="color: #465457;">it's likely that os::Linux::initial_thread_stack_bottom is mapped and</span>
    <span style="color: #465457;">// </span><span style="color: #465457;">we don't need to do anything special.</span>
    <span style="color: #465457;">// </span><span style="color: #465457;">Check it first, before calling heavy function.</span>
    <span style="color: #66d9ef; font-weight: bold;">uintptr_t</span> <span style="color: #fd971f;">stack_extent</span> = (<span style="color: #66d9ef; font-weight: bold;">uintptr_t</span>) <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::initial_thread_stack_bottom();
    <span style="color: #66d9ef; font-weight: bold;">unsigned</span> <span style="color: #66d9ef; font-weight: bold;">char</span> <span style="color: #fd971f;">vec</span>[1];

    <span style="color: #f92672; font-weight: bold;">if</span> (mincore((<span style="color: #66d9ef; font-weight: bold;">address</span>)stack_extent, <span style="color: #ae81ff;">os</span>::vm_page_size(), vec) == -1) {
      <span style="color: #465457;">// </span><span style="color: #465457;">Fallback to slow path on all errors, including EAGAIN</span>
      stack_extent = (<span style="color: #66d9ef; font-weight: bold;">uintptr_t</span>) get_stack_commited_bottom(
                                    <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::initial_thread_stack_bottom(),
                                    (<span style="color: #66d9ef; font-weight: bold;">size_t</span>)addr - stack_extent);
    }

    <span style="color: #f92672; font-weight: bold;">if</span> (stack_extent &lt; (<span style="color: #66d9ef; font-weight: bold;">uintptr_t</span>)addr) {
      ::munmap((<span style="color: #66d9ef; font-weight: bold;">void</span>*)stack_extent, (<span style="color: #66d9ef; font-weight: bold;">uintptr_t</span>)(addr - stack_extent));
    }
  }

  <span style="color: #465457;">// </span><span style="color: #465457;">&#9733;&#12371;&#12371;&#12363;&#12425; mmap&#12471;&#12473;&#12486;&#12512;&#12467;&#12540;&#12523;&#12364;&#30330;&#34892;&#12373;&#12428;&#12427;&#12290;</span>
  <span style="color: #465457;">//  </span><span style="color: #465457;">&#26368;&#24460;&#12398;&#24341;&#25968;&#12395;&#26360;&#12365;&#36796;&#12415;&#19981;&#21487;&#12398;&#12501;&#12521;&#12464;&#12364;&#20184;&#19982;&#12373;&#12428;&#12383;</span>
  <span style="color: #f92672; font-weight: bold;">return</span> <span style="color: #ae81ff;">os</span>::commit_memory(addr, size, <span style="color: #960050;">!</span>ExecMem);
}
</pre>
</div>

<p>
以下は <code>JBoss AS7</code> アプリケーションサーバ実行時、ワーカスレッドのスタック仮想メモリ割
当状況です。
</p>

<pre class="example">
$ cat /proc/`ps -ef | grep [j]boss.modules.system | awk '{print $2}'`/smaps
...省略...
7ff751076000-7ff751079000 ---p 00000000 00:00 0
Size:                 12 kB    ★説明: StackRedPages(4Kb) + StackYellowPages(8Kb) = 12Kb
Rss:                   0 kB
Pss:                   0 kB
Shared_Clean:          0 kB
Shared_Dirty:          0 kB
Private_Clean:         0 kB
Private_Dirty:         0 kB
Referenced:            0 kB
Anonymous:             0 kB
AnonHugePages:         0 kB
Swap:                  0 kB
KernelPageSize:        4 kB
MMUPageSize:           4 kB
Locked:                0 kB
VmFlags: mr mw me ac          ★説明:書き込み不可
7ff751079000-7ff751177000 rw-p 00000000 00:00 0                          [stack:21275]
Size:               1016 kB   ★説明: ここからNormal Stackページ
Rss:                 108 kB
Pss:                 108 kB
Shared_Clean:          0 kB
Shared_Dirty:          0 kB
Private_Clean:         0 kB
Private_Dirty:       108 kB
Referenced:          108 kB
Anonymous:           108 kB
AnonHugePages:         0 kB
Swap:                  0 kB
KernelPageSize:        4 kB
MMUPageSize:           4 kB
Locked:                0 kB
VmFlags: rd wr mr mw me ac
...省略...
</pre>

<p>
次のSystemTapスクリプトで <code>HotSpot Guard Pages</code> の割当処理をトレースしてみた。
</p>

<p>
<code>jvm_memory_trace.stp</code>
</p>
<pre class="example">
#!/usr/bin/stap -p4
probe process("/usr/lib/jvm/java-1.7.0-openjdk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so").function("commit_memory_impl")
{
   printf("---------------------------------------------------------\n")
   printf("%d\t%s\n", tid(), $$parms)
   print_ustack(ubacktrace())
}
</pre>

<p>
出力結果
</p>
<pre class="example">
  |$ stap jvm_memory_trace.stp -c "java  -version"
  |Using a compile server.
  |WARNING: Missing unwind data for module, rerun with 'stap -d ...dk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/jli/libjli.so'
  |WARNING: Missing unwind data for module, rerun with 'stap -d /usr/lib64/libpthread-2.17.so'
  |java version "1.7.0_75"
  |OpenJDK Runtime Environment (rhel-2.5.4.7.el7_1-x86_64 u75-b13)
  |OpenJDK 64-Bit Server VM (build 24.75-b04, mixed mode)
  |
  |★省略★
  |--------------------------------------------------------------------------------------------------------------
①|12179	exec=0x0 size=0x3000 addr=0x7f1d05b57000  ★commit_memory_impl関数実行時の引数情報
  | 0x7f1d04808371 : _ZN2os16pd_commit_memoryEPcmb+0x1/0xf0 [...1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so]
  | 0x7f1d04802dee : _ZN2os13commit_memoryEPcmb+0x2e/0xd0 [...1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so]
②| 0x7f1d048092df : _ZN2os27pd_create_stack_guard_pagesEPcm+0x7f/0x180 [...1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so]
  | 0x7f1d04945519 : _ZN7Threads9create_vmEP14JavaVMInitArgsPb+0x339/0x1550 [...1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so]
  | 0x7f1d0463fca7 : JNI_CreateJavaVM+0x67/0x2a0 [...1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so]
  | 0x7f1d0562aa68 : 0x7f1d0562aa68 [...dk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/jli/libjli.so+0x2a68/0x20e000]
  |--------------------------------------------------------------------------------------------------------------
  |★以降は省略★
</pre>

<p>
出力結果に①の <a href="http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l2728">commit_memory_impl</a> 仮想メモリ割当処理の第２引数にメモリサイズを指定し
ています。 <code>size=0x3000</code> の値が16進数ですので、10進数に変換すると12Kbです。予測通りで
すね。
</p>

<p>
gdbを用いて上記出力結果から②のソースコード位置を特定する方法を以下に示す。
</p>
<pre class="example">
$ gdb /usr/lib/jvm/java-1.7.0-openjdk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so
GNU gdb (GDB) Red Hat Enterprise Linux 7.6.1-64.el7
★一部内容省略★
Reading symbols from /usr/lib/jvm/java-1.7.0-openjdk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so...Reading symbols from /usr/lib/debug/usr/lib/jvm/java-1.7.0-openjdk-1.7.0.75-2.5.4.7.el7_1.x86_64/jre/lib/amd64/server/libjvm.so.debug...done.
done.
★出力結果から関数名ぽいの文字列で関数を探す
(gdb) info functions pd_create_stack_guard_pages
All functions matching regular expression "pd_create_stack_guard_pages":

★検索結果
File /usr/src/debug/java-1.7.0-openjdk-1.7.0.75-2.5.4.7.el7_1.x86_64/openjdk/hotspot/src/os/linux/vm/os_linux.cpp:
bool os::pd_create_stack_guard_pages(char*, unsigned long);
(gdb)
</pre>
</div>
</div>
