blog/2015-04-22-[調査]jvmのスタックサイズについて.org
** Normal Stack
Javaスレッドを前提に置いて、 =Normal Stack= には通常Javaメソッド実行時のフレーム情報
が格納される。ただし、スレッドからC/C++メソッドを実行する時も =Normal Stack= が利用さ
れる。スタックのトップ位置にC/C++メソッド実行用の =StackShadowPages= が設けられている。
Linux/x86_64環境に置いて =StackShadowPages= の初期値が20である。

#+begin_example

                +------------------------+
               /|                        |\
              / |    StackShadowPages    | -XX:StackShadowPages=20(80Kb)
             /  |                        |/ ★Native Stackはここです!
            /   +------------------------+
           /    |                        |
          /     |   +----------------+   |  ★Java Stackはここです！
  Normal Stack  |   |     Frame      |   |
          \     |   +----------------+   |
           \    |   |     Frame      |   |
            \   |   +----------------+   |
             \  |   |     Frame      |   |
              \ |   +----------------+   |
               \|                        |
                +------------------------+
#+end_example
=図5=

以下は =StackShadowPages= 初期値の代入処理ロジックです。

[[http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/cpu/x86/vm/globals_x86.hpp#l60][jdk7:hotspot/src/cpu/x86/vm/globals_x86.hpp#l60]]
#+begin_src c++
#ifdef AMD64
// Very large C++ stack frames using solaris-amd64 optimized builds
// due to lack of optimization caused by C++ compiler bugs
define_pd_global(intx, StackShadowPages, NOT_WIN64(20) WIN64_ONLY(6) DEBUG_ONLY(+2));
#else
define_pd_global(intx, StackShadowPages, 6 DEBUG_ONLY(+5));
#endif // AMD64
#+end_src

=StackShadowPages= に関して以下の情報が参考になると思います。
- [[https://docs.oracle.com/javase/7/docs/webnotes/tsg/TSG-VM/html/crashes.html#gbyzz][Troubleshooting Guide for HotSpot VM 4.1.3 Crash due to Stack Overflow]]
- [[http://bugs.java.com/bugdatabase/view_bug.do?bug_id%3D7059899a][JDK-7059899 : Stack overflows in Java code cause 64-bit JVMs to exit due to SIGSEGV]]
- [[https://access.redhat.com/solutions/698483][What does the StackShadowPages JVM setting do?]]
  #+begin_example
  StackShadowPages reserves a portion of the thread stack for native layer
  allocations. The page size usually is 4096b, which mean that 20 pages would occupy
  80Kb. The thread stack is sized through -Xss.
   
  Consider some config examples:
   
     -Xss1024k -XX:StackShadowPages=10
   
     [       984kb java stack    | 40kb native stack]
   
     -Xss1024k -XX:StackShadowPages=20
   
     [       944kb java stack    |   80kb native stack]
   
     -Xss512k -XX:StackShadowPages=10
   
     [ 472kb java stack | 40kb native stack]
   
  If you decrease just -Xss, the overall stack is decreased, but the StackShadowPages
  native reservation is not; only the java portion would lose space. Likewise if you
  only increase -Xss, only the java portion gains space with the increased stack.
   
  If you increase StackShadowPages, the java portion becomes smaller so that the native
  portion can be larger. If the native portion of a stack is exhausted, the JVM can
  fatally crash so sometimes StackShadowPages needs to be increased.
  #+end_example

