blog/2015-04-22-[調査]jvmのスタックサイズについて.org
* スタックサイズの制御
従いましてJava Methodに使えるスタック領域(Java Stack)のサイズは次の式で計算出来る。
#+begin_html
<font color="red"><strong>
#+end_html
Java Satck Size = Thread::stack_size() - ((StackRedPages + StackYellowPages + StackShadowPages) * PageSize)
#+begin_html
</strong></font>
#+end_html

=Thread::stack_size()= の値はスレッド起動時にglibcの [[http://linuxjm.sourceforge.jp/html/LDP_man-pages/man3/pthread_attr_setstacksize.3.html][pthread_attr_setstacksize]] 関数を
用いて設定される。以下はHotSpotの実装です。

1. JVM起動時に実行される処理
   [[http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l4820][jdk7/hotspot/src/os/linux/vm/os_linux.cpp#4820]]
   #+begin_src c++
   // this is called _after_ the global arguments have been parsed
   jint os::init_2(void)
   {
     ★一部省略★
    
    
     ★スレッドに割当るスタックサイズの最小許容値の計算
    
     // Check minimum allowable stack size for thread creation and to initialize
     // the java system classes, including StackOverflowError - depends on page
     // size.  Add a page for compiler2 recursion in main thread.
     // Add in 2*BytesPerWord times page size to account for VM stack during
     // class initialization depending on 32 or 64 bit VM.
     os::Linux::min_stack_allowed = MAX2(os::Linux::min_stack_allowed,
               (size_t)(StackYellowPages+StackRedPages+StackShadowPages) * Linux::page_size() +
                       (2*BytesPerWord COMPILER2_PRESENT(+1)) * Linux::vm_default_page_size());
    
   #ifdef ZERO
     // If this is Zero, allow at the very minimum one page each for the
     // Zero stack and the native stack.  This won't make any difference
     // for 4k pages, but is significant for large pages.
     os::Linux::min_stack_allowed = MAX2(os::Linux::min_stack_allowed,
                (size_t)(StackYellowPages+StackRedPages+StackShadowPages+2) * Linux::page_size());
   #endif
    
     size_t threadStackSizeInBytes = ThreadStackSize * K;
     if (threadStackSizeInBytes != 0 &&
         threadStackSizeInBytes < os::Linux::min_stack_allowed) {
           tty->print_cr("\nThe stack size specified is too small, "
                         "Specify at least %dk",
                         os::Linux::min_stack_allowed/ K);
           return JNI_ERR;
     }
    
     ★-XX:ThreadStackSizeの値を静的_stack_size_at_create変数に代入する
     // Make the stack size a multiple of the page size so that
     // the yellow/red zones can be guarded.
     JavaThread::set_stack_size_at_create(round_to(threadStackSizeInBytes,
           vm_page_size()));
    
     ★イニシャルスレッドのスタックサイズ設定処理（★TODO: 別途調査する）
     Linux::capture_initial_stack(JavaThread::stack_size_at_create());
   
     ★以下は省略★
  #+end_src
2. 新規スレッド起動時の処理
   [[http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l901][jdk7:hotspot/src/os/linux/vm/os_linux.cpp#901]]
   #+begin_src c++
   bool os::create_thread(Thread* thread, ThreadType thr_type, size_t stack_size) {
    
     ★一部省略★
    
     // ★スレッド種別毎にスタックサイズを決める
     if (os::Linux::supports_variable_stack_size()) {
       // calculate stack size if it's not specified by caller
       if (stack_size == 0) {
         stack_size = os::Linux::default_stack_size(thr_type);
    
         switch (thr_type) {
    
         //★Javaワーカスレッドの場合
         case os::java_thread:
           // Java threads use ThreadStackSize which default value can be
           // changed with the flag -Xss
           assert (JavaThread::stack_size_at_create() > 0, "this should be set");
           stack_size = JavaThread::stack_size_at_create();
           break;
    
         //★JITコンパイラスレッドの場合
         case os::compiler_thread:
           if (CompilerThreadStackSize > 0) {
             stack_size = (size_t)(CompilerThreadStackSize * K);
             break;
           } // else fall through:
             // use VMThreadStackSize if CompilerThreadStackSize is not defined
    
         //★VMスレッド、GCスレッド、ウォッチャースレッドの場合
         case os::vm_thread:
         case os::pgc_thread:
         case os::cgc_thread:
         case os::watcher_thread:
           if (VMThreadStackSize > 0) stack_size = (size_t)(VMThreadStackSize * K);
           break;
         }
       }
    
       stack_size = MAX2(stack_size, os::Linux::min_stack_allowed);
       // ★glic関数用いてstack領域を確保する
       pthread_attr_setstacksize(&attr, stack_size);
    
      ★以下は省略★
   #+end_src

以上コードの通り、JVMから起動されたスレッドの種別毎のスタックサイズが下記XXパラメータ値が適用されてい
る。

|-----------------------------+------------------------+----------------------------------------------------|
| 引数                        | Linux/x86_64環境初期値 | 適用範囲                                           |
|-----------------------------+------------------------+----------------------------------------------------|
| -XX:ThreadStackSize         | 1M                     | Javaスレッド                                       |
| -XX:VMThreadStackSize       | 1M                     | VM thread、GC threads、VM Periodic Task Threadなど |
| -XX:CompilerThreadStackSize | 4M                     | C1 C2 CompilerThread                               |
|-----------------------------+------------------------+----------------------------------------------------|

以下は実機にて確認された各パラメータの初期値です。
#+begin_example
$ java -XX:+PrintFlagsFinal -version | grep -e "CompilerThreadStackSize\|ThreadStackSize\|VMThreadStackSize"
     intx CompilerThreadStackSize                   = 0               {pd product}
     intx ThreadStackSize                           = 1024            {pd product}
     intx VMThreadStackSize                         = 1024            {pd product}
java version "1.7.0_75"
OpenJDK Runtime Environment (rhel-2.5.4.7.el7_1-x86_64 u75-b13)
OpenJDK 64-Bit Server VM (build 24.75-b04, mixed mode)
#+end_example

=CompilerThreadStackSize= が指定しない場合下記コードにて初期値が代入される。

[[http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#l652][jdk7:hotspot/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#652]]
#+begin_src c++
// return default stack size for thr_type
size_t os::Linux::default_stack_size(os::ThreadType thr_type) {
  // default stack size (compiler thread needs larger stack)
#ifdef AMD64
  size_t s = (thr_type == os::compiler_thread ? 4 * M : 1 * M);
#else
  size_t s = (thr_type == os::compiler_thread ? 2 * M : 512 * K);
#endif // AMD64
  return s;
}
#+end_src

次のサンプルプログラムを実行して、各スレッドのスタックサイズ値を実測してみる。

=HelloWorld.java=
#+begin_src java
public class HelloWorld implements Runnable {

    public void run(){
        while(true) {
            try {
                Thread.sleep(1 * 1000L);
                System.out.println(Thread.currentThread().toString() + ": Hello World");
            } catch (Exception e) {
            }
        }
    }

    public static void main(String[] args) throws Exception {
        Thread[] t_arry =  new Thread[5];
        for (int i = 0; i < t_arry.length; i++) {
            t_arry[i]  =  new Thread(new HelloWorld());
            t_arry[i].start();
        }
        for (int i = 0; i < t_arry.length; i++) {
            t_arry[i].join();
        }

    }
}
#+end_src

スタックサイズの実測値は次のスクリプトで取得しています。

=jvm_stacksize.sh=
#+begin_src sh
#!/bin/sh

if [ ! $# -eq 1 ]; then
    echo "Usage ${0} <JVM PID>"
    exit 1
fi

printf "[ PID ]\t[StackSize]\t[GuardPages]\t[Thread Name]\n"

# jstackの出力結果からスレッドIDと名前を抽出する
jstack $1 | grep nid | sed -e "s/^\"\(.*\)\".*nid=\(0x[0-9|a-z]*\).*$/\2,\1/" | sort | while read line
do
    # スレッドIDを切り出す
    pid_hex=`echo "${line}" | awk -F"," '{print $1}'`

    # スレッド名を切り出す
    thread_name=`echo "${line}" | awk -F"," '{print $2}'`

    # スレッドIDを10進数に変換
    pid=`printf '%d\n' ${pid_hex}`

    # /proc/<pid>/smaps ファイルからスタックサイズ、ガードページサイズを取得する
    guard_page=`cat /proc/$1/smaps | grep -B15 "stack:${pid}"| head -1 | awk '{print $2}'`
    stack_page=`cat /proc/$1/smaps | grep -A1 "stack:${pid}" | tail -1 | awk '{print $2}'`
    stack_size=`expr ${guard_page} + ${stack_page}`
    printf "%7d\t%11s\t%12s\t%s\n" "${pid}" "${stack_size}Kb" "${guard_page}Kb" "${thread_name}"
done
#+end_src

スタックサイズを明示的に指定して、サンプルを実行する。
- -XX:ThreadStackSize=512
- -XX:VMThreadStackSize: 2048
- -XX:CompilerThreadStackSize=3072
#+begin_example
java -XX:VMThreadStackSize=2048 -XX:CompilerThreadStackSize=3072 -XX:ThreadStackSize=512 HelloWorld
Thread[Thread-0,5,main]: Hello World
Thread[Thread-4,5,main]: Hello World
Thread[Thread-1,5,main]: Hello World
Thread[Thread-3,5,main]: Hello World
Thread[Thread-2,5,main]: Hello World
★以降は省略
#+end_example

測定結果
#+begin_example
$ ./jvm_stacksize.sh `ps -ef | grep "[j]ava.*HelloWorld" | awk '{print $2}'`
[ PID ]	[StackSize]	[GuardPages]	[Thread Name]
  17285	     1048Kb	        12Kb	main
  17286	     2096Kb	         4Kb	GC task thread#0 (ParallelGC)
  17287	     2052Kb	         4Kb	GC task thread#1 (ParallelGC)
  17288	     2052Kb	         4Kb	GC task thread#2 (ParallelGC)
  17289	     2052Kb	         4Kb	GC task thread#3 (ParallelGC)
  17290	     2052Kb	         4Kb	VM Thread
  17291	    64584Kb	        12Kb	Reference Handler
  17292	      516Kb	        12Kb	Finalizer
  17293	      516Kb	        12Kb	Signal Dispatcher
  17294	     3076Kb	        12Kb	C2 CompilerThread0
  17295	     3076Kb	        12Kb	C2 CompilerThread1
  17296	      516Kb	        12Kb	Service Thread
  17297	     2052Kb	         4Kb	VM Periodic Task Thread
  17298	      516Kb	        12Kb	Thread-0
  17299	      516Kb	        12Kb	Thread-1
  17300	      516Kb	        12Kb	Thread-2
  17301	      516Kb	        12Kb	Thread-3
  17302	      516Kb	        12Kb	Thread-4
  17342	      516Kb	        12Kb	Attach Listener
#+end_example

実測値はXXパラメータで指定した値より１ページ分多い。これは =glibc= 内部の
[[https://www.sourceware.org/git/gitweb.cgi?p%3Dglibc.git%3Ba%3Dblob%3Bf%3Dnptl/allocatestack.c%3Bh%3D8e620c46e9523092a5cf141e77f35c94dcfd9810%3Bhb%3DHEAD#l349][allocate_stack]] 処理で追加されているものです。

