blog/2015-04-22-[調査]jvmのスタックサイズについて.html

<div id="outline-container-sec-5" class="outline-2">
<h2 id="sec-5"><span class="section-number-2">5</span> スタックサイズの制御</h2>
<div class="outline-text-2" id="text-5">
<p>
従いましてJava Methodに使えるスタック領域(Java Stack)のサイズは次の式で計算出来る。
</p>
<font color="red"><strong>
<p>
Java Satck Size = Thread::stack_size() - ((StackRedPages + StackYellowPages + StackShadowPages) * PageSize)
</p>
</strong></font>

<p>
<code>Thread::stack_size()</code> の値はスレッド起動時にglibcの <a href="http://linuxjm.sourceforge.jp/html/LDP_man-pages/man3/pthread_attr_setstacksize.3.html">pthread_attr_setstacksize</a> 関数を
用いて設定される。以下はHotSpotの実装です。
</p>

<ol class="org-ol">
<li>JVM起動時に実行される処理
<a href="http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l4820">jdk7/hotspot/src/os/linux/vm/os_linux.cpp#4820</a>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #465457;">// </span><span style="color: #465457;">this is called _after_ the global arguments have been parsed</span>
<span style="color: #66d9ef; font-weight: bold;">jint</span> <span style="color: #ae81ff;">os</span>::<span style="color: #a6e22e;">init_2</span>(<span style="color: #66d9ef; font-weight: bold;">void</span>)
{
  &#9733;&#19968;&#37096;&#30465;&#30053;&#9733;


  &#9733;&#12473;&#12524;&#12483;&#12489;&#12395;&#21106;&#24403;&#12427;&#12473;&#12479;&#12483;&#12463;&#12469;&#12452;&#12474;&#12398;&#26368;&#23567;&#35377;&#23481;&#20516;&#12398;&#35336;&#31639;

  <span style="color: #465457;">// </span><span style="color: #465457;">Check minimum allowable stack size for thread creation and to initialize</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">the java system classes, including StackOverflowError - depends on page</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">size.  Add a page for compiler2 recursion in main thread.</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">Add in 2*BytesPerWord times page size to account for VM stack during</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">class initialization depending on 32 or 64 bit VM.</span>
  <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed = MAX2(<span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed,
            (<span style="color: #66d9ef; font-weight: bold;">size_t</span>)(StackYellowPages+StackRedPages+StackShadowPages) * <span style="color: #ae81ff;">Linux</span>::page_size() +
                    (2*BytesPerWord COMPILER2_PRESENT(+1)) * <span style="color: #ae81ff;">Linux</span>::vm_default_page_size());

<span style="color: #a6e22e;">#ifdef</span> ZERO
  <span style="color: #465457;">// </span><span style="color: #465457;">If this is Zero, allow at the very minimum one page each for the</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">Zero stack and the native stack.  This won't make any difference</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">for 4k pages, but is significant for large pages.</span>
  <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed = MAX2(<span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed,
             (<span style="color: #66d9ef; font-weight: bold;">size_t</span>)(StackYellowPages+StackRedPages+StackShadowPages+2) * <span style="color: #ae81ff;">Linux</span>::page_size());
<span style="color: #a6e22e;">#endif</span>

  <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">threadStackSizeInBytes</span> = ThreadStackSize * K;
  <span style="color: #f92672; font-weight: bold;">if</span> (threadStackSizeInBytes != 0 &amp;&amp;
      threadStackSizeInBytes &lt; <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed) {
        tty-&gt;print_cr(<span style="color: #e6db74;">"\nThe stack size specified is too small, "</span>
                      <span style="color: #e6db74;">"Specify at least %dk"</span>,
                      <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed/ K);
        <span style="color: #f92672; font-weight: bold;">return</span> JNI_ERR;
  }

  &#9733;-XX:ThreadStackSize&#12398;&#20516;&#12434;&#38745;&#30340;_stack_size_at_create&#22793;&#25968;&#12395;&#20195;&#20837;&#12377;&#12427;
  <span style="color: #465457;">// </span><span style="color: #465457;">Make the stack size a multiple of the page size so that</span>
  <span style="color: #465457;">// </span><span style="color: #465457;">the yellow/red zones can be guarded.</span>
  <span style="color: #ae81ff;">JavaThread</span>::set_stack_size_at_create(round_to(threadStackSizeInBytes,
        vm_page_size()));

  &#9733;&#12452;&#12491;&#12471;&#12515;&#12523;&#12473;&#12524;&#12483;&#12489;&#12398;&#12473;&#12479;&#12483;&#12463;&#12469;&#12452;&#12474;&#35373;&#23450;&#20966;&#29702;&#65288;&#9733;TODO: &#21029;&#36884;&#35519;&#26619;&#12377;&#12427;&#65289;
  <span style="color: #ae81ff;">Linux</span>::capture_initial_stack(<span style="color: #ae81ff;">JavaThread</span>::stack_size_at_create());

  &#9733;&#20197;&#19979;&#12399;&#30465;&#30053;&#9733;
</pre>
</div>
</li>
<li>新規スレッド起動時の処理
<a href="http://hg.openjdk.java.net/jdk7u/jdk7u60/hotspot/file/ba66650acf63/src/os/linux/vm/os_linux.cpp#l901">jdk7:hotspot/src/os/linux/vm/os_linux.cpp#901</a>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #66d9ef; font-weight: bold;">bool</span> <span style="color: #ae81ff;">os</span>::<span style="color: #a6e22e;">create_thread</span>(<span style="color: #66d9ef; font-weight: bold;">Thread</span>* <span style="color: #fd971f;">thread</span>, <span style="color: #66d9ef; font-weight: bold;">ThreadType</span> <span style="color: #fd971f;">thr_type</span>, <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">stack_size</span>) {

  &#9733;&#19968;&#37096;&#30465;&#30053;&#9733;

  <span style="color: #465457;">// </span><span style="color: #465457;">&#9733;&#12473;&#12524;&#12483;&#12489;&#31278;&#21029;&#27598;&#12395;&#12473;&#12479;&#12483;&#12463;&#12469;&#12452;&#12474;&#12434;&#27770;&#12417;&#12427;</span>
  <span style="color: #f92672; font-weight: bold;">if</span> (<span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::supports_variable_stack_size()) {
    <span style="color: #465457;">// </span><span style="color: #465457;">calculate stack size if it's not specified by caller</span>
    <span style="color: #f92672; font-weight: bold;">if</span> (stack_size == 0) {
      stack_size = <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::default_stack_size(thr_type);

      <span style="color: #f92672; font-weight: bold;">switch</span> (thr_type) {

      <span style="color: #465457;">//</span><span style="color: #465457;">&#9733;Java&#12527;&#12540;&#12459;&#12473;&#12524;&#12483;&#12489;&#12398;&#22580;&#21512;</span>
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::java_thread:
        <span style="color: #465457;">// </span><span style="color: #465457;">Java threads use ThreadStackSize which default value can be</span>
        <span style="color: #465457;">// </span><span style="color: #465457;">changed with the flag -Xss</span>
        assert (<span style="color: #ae81ff;">JavaThread</span>::stack_size_at_create() &gt; 0, <span style="color: #e6db74;">"this should be set"</span>);
        stack_size = <span style="color: #ae81ff;">JavaThread</span>::stack_size_at_create();
        <span style="color: #f92672; font-weight: bold;">break</span>;

      <span style="color: #465457;">//</span><span style="color: #465457;">&#9733;JIT&#12467;&#12531;&#12497;&#12452;&#12521;&#12473;&#12524;&#12483;&#12489;&#12398;&#22580;&#21512;</span>
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::compiler_thread:
        <span style="color: #f92672; font-weight: bold;">if</span> (CompilerThreadStackSize &gt; 0) {
          stack_size = (<span style="color: #66d9ef; font-weight: bold;">size_t</span>)(CompilerThreadStackSize * K);
          <span style="color: #f92672; font-weight: bold;">break</span>;
        } <span style="color: #465457;">// </span><span style="color: #465457;">else fall through:</span>
          <span style="color: #465457;">// </span><span style="color: #465457;">use VMThreadStackSize if CompilerThreadStackSize is not defined</span>

      <span style="color: #465457;">//</span><span style="color: #465457;">&#9733;VM&#12473;&#12524;&#12483;&#12489;&#12289;GC&#12473;&#12524;&#12483;&#12489;&#12289;&#12454;&#12457;&#12483;&#12481;&#12515;&#12540;&#12473;&#12524;&#12483;&#12489;&#12398;&#22580;&#21512;</span>
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::vm_thread:
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::pgc_thread:
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::cgc_thread:
      <span style="color: #f92672; font-weight: bold;">case</span> <span style="color: #ae81ff;">os</span>::watcher_thread:
        <span style="color: #f92672; font-weight: bold;">if</span> (VMThreadStackSize &gt; 0) stack_size = (<span style="color: #66d9ef; font-weight: bold;">size_t</span>)(VMThreadStackSize * K);
        <span style="color: #f92672; font-weight: bold;">break</span>;
      }
    }

    stack_size = MAX2(stack_size, <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::min_stack_allowed);
    <span style="color: #465457;">// </span><span style="color: #465457;">&#9733;glic&#38306;&#25968;&#29992;&#12356;&#12390;stack&#38936;&#22495;&#12434;&#30906;&#20445;&#12377;&#12427;</span>
    pthread_attr_setstacksize(&amp;attr, stack_size);

   &#9733;&#20197;&#19979;&#12399;&#30465;&#30053;&#9733;
</pre>
</div>
</li>
</ol>

<p>
以上コードの通り、JVMから起動されたスレッドの種別毎のスタックサイズが下記XXパラメータ値が適用されてい
る。
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="left">引数</th>
<th scope="col" class="left">Linux/x86_64環境初期値</th>
<th scope="col" class="left">適用範囲</th>
</tr>
</thead>
<tbody>
<tr>
<td class="left">-XX:ThreadStackSize</td>
<td class="left">1M</td>
<td class="left">Javaスレッド</td>
</tr>

<tr>
<td class="left">-XX:VMThreadStackSize</td>
<td class="left">1M</td>
<td class="left">VM thread、GC threads、VM Periodic Task Threadなど</td>
</tr>

<tr>
<td class="left">-XX:CompilerThreadStackSize</td>
<td class="left">4M</td>
<td class="left">C1 C2 CompilerThread</td>
</tr>
</tbody>
</table>

<p>
以下は実機にて確認された各パラメータの初期値です。
</p>
<pre class="example">
$ java -XX:+PrintFlagsFinal -version | grep -e "CompilerThreadStackSize\|ThreadStackSize\|VMThreadStackSize"
     intx CompilerThreadStackSize                   = 0               {pd product}
     intx ThreadStackSize                           = 1024            {pd product}
     intx VMThreadStackSize                         = 1024            {pd product}
java version "1.7.0_75"
OpenJDK Runtime Environment (rhel-2.5.4.7.el7_1-x86_64 u75-b13)
OpenJDK 64-Bit Server VM (build 24.75-b04, mixed mode)
</pre>

<p>
<code>CompilerThreadStackSize</code> が指定しない場合下記コードにて初期値が代入される。
</p>

<p>
<a href="http://hg.openjdk.java.net/jdk7/jdk7/hotspot/file/9b0ca45cd756/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#l652">jdk7:hotspot/src/os_cpu/linux_x86/vm/os_linux_x86.cpp#652</a>
</p>
<div class="org-src-container">

<pre class="src src-c++"><span style="color: #465457;">// </span><span style="color: #465457;">return default stack size for thr_type</span>
<span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #ae81ff;">os</span>::<span style="color: #ae81ff;">Linux</span>::<span style="color: #a6e22e;">default_stack_size</span>(<span style="color: #ae81ff;">os</span>::<span style="color: #66d9ef; font-weight: bold;">ThreadType</span> <span style="color: #fd971f;">thr_type</span>) {
  <span style="color: #465457;">// </span><span style="color: #465457;">default stack size (compiler thread needs larger stack)</span>
<span style="color: #a6e22e;">#ifdef</span> AMD64
  <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">s</span> = (thr_type == <span style="color: #ae81ff;">os</span>::compiler_thread ? 4 * M : 1 * M);
<span style="color: #a6e22e;">#else</span>
  <span style="color: #66d9ef; font-weight: bold;">size_t</span> <span style="color: #fd971f;">s</span> = (thr_type == <span style="color: #ae81ff;">os</span>::compiler_thread ? 2 * M : 512 * K);
<span style="color: #a6e22e;">#endif</span> <span style="color: #465457;">// </span><span style="color: #465457;">AMD64</span>
  <span style="color: #f92672; font-weight: bold;">return</span> s;
}
</pre>
</div>

<p>
次のサンプルプログラムを実行して、各スレッドのスタックサイズ値を実測してみる。
</p>

<p>
<code>HelloWorld.java</code>
</p>
<div class="org-src-container">

<pre class="src src-java"><span style="color: #f92672; font-weight: bold;">public</span> <span style="color: #f92672; font-weight: bold;">class</span> <span style="color: #66d9ef; font-weight: bold;">HelloWorld</span> <span style="color: #f92672; font-weight: bold;">implements</span> <span style="color: #66d9ef; font-weight: bold;">Runnable</span> {

    <span style="color: #f92672; font-weight: bold;">public</span> <span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">run</span>(){
        <span style="color: #f92672; font-weight: bold;">while</span>(<span style="color: #ae81ff;">true</span>) {
            <span style="color: #f92672; font-weight: bold;">try</span> {
                Thread.sleep(1 * 1000L);
                System.out.println(Thread.currentThread().toString() + <span style="color: #e6db74;">": Hello World"</span>);
            } <span style="color: #f92672; font-weight: bold;">catch</span> (<span style="color: #66d9ef; font-weight: bold;">Exception</span> <span style="color: #fd971f;">e</span>) {
            }
        }
    }

    <span style="color: #f92672; font-weight: bold;">public</span> <span style="color: #f92672; font-weight: bold;">static</span> <span style="color: #66d9ef; font-weight: bold;">void</span> <span style="color: #a6e22e;">main</span>(<span style="color: #66d9ef; font-weight: bold;">String</span>[] <span style="color: #fd971f;">args</span>) <span style="color: #f92672; font-weight: bold;">throws</span> <span style="color: #66d9ef; font-weight: bold;">Exception</span> {
        <span style="color: #66d9ef; font-weight: bold;">Thread</span>[] <span style="color: #fd971f;">t_arry</span> =  <span style="color: #f92672; font-weight: bold;">new</span> <span style="color: #66d9ef; font-weight: bold;">Thread</span>[5];
        <span style="color: #f92672; font-weight: bold;">for</span> (<span style="color: #66d9ef; font-weight: bold;">int</span> <span style="color: #fd971f;">i</span> = 0; i &lt; t_arry.<span style="color: #66d9ef; font-weight: bold;">length</span>; i++) {
            t_arry[i]  =  <span style="color: #f92672; font-weight: bold;">new</span> <span style="color: #66d9ef; font-weight: bold;">Thread</span>(<span style="color: #f92672; font-weight: bold;">new</span> <span style="color: #66d9ef; font-weight: bold;">HelloWorld</span>());
            t_arry[i].start();
        }
        <span style="color: #f92672; font-weight: bold;">for</span> (<span style="color: #66d9ef; font-weight: bold;">int</span> <span style="color: #fd971f;">i</span> = 0; i &lt; t_arry.<span style="color: #66d9ef; font-weight: bold;">length</span>; i++) {
            t_arry[i].join();
        }

    }
}
</pre>
</div>

<p>
スタックサイズの実測値は次のスクリプトで取得しています。
</p>

<p>
<code>jvm_stacksize.sh</code>
</p>
<div class="org-src-container">

<pre class="src src-sh"><span style="color: #465457;">#</span><span style="color: #465457;">!/bin/</span><span style="color: #f92672; font-weight: bold;">sh</span>

<span style="color: #f92672; font-weight: bold;">if</span> [ <span style="color: #960050;">!</span> $<span style="color: #fd971f;">#</span> -eq 1 ]; <span style="color: #f92672; font-weight: bold;">then</span>
    <span style="color: #a6e22e;">echo</span> <span style="color: #e6db74;">"Usage ${0} &lt;JVM PID&gt;"</span>
    <span style="color: #f92672; font-weight: bold;">exit</span> 1
<span style="color: #f92672; font-weight: bold;">fi</span>

<span style="color: #a6e22e;">printf</span> <span style="color: #e6db74;">"[ PID ]\t[StackSize]\t[GuardPages]\t[Thread Name]\n"</span>

<span style="color: #465457;"># </span><span style="color: #465457;">jstack&#12398;&#20986;&#21147;&#32080;&#26524;&#12363;&#12425;&#12473;&#12524;&#12483;&#12489;ID&#12392;&#21517;&#21069;&#12434;&#25277;&#20986;&#12377;&#12427;</span>
jstack $<span style="color: #fd971f;">1</span> | grep nid | sed -e <span style="color: #e6db74;">"s/^\"\(.*\)\".*nid=\(0x[0-9|a-z]*\).*$/\2,\1/"</span> | sort | <span style="color: #f92672; font-weight: bold;">while </span><span style="color: #a6e22e;">read</span> line
<span style="color: #f92672; font-weight: bold;">do</span>
    <span style="color: #465457;"># </span><span style="color: #465457;">&#12473;&#12524;&#12483;&#12489;ID&#12434;&#20999;&#12426;&#20986;&#12377;</span>
    <span style="color: #fd971f;">pid_hex</span>=<span style="color: #fa8072;">`echo "${line}" | awk -F"," '{print $1}'`</span>

    <span style="color: #465457;"># </span><span style="color: #465457;">&#12473;&#12524;&#12483;&#12489;&#21517;&#12434;&#20999;&#12426;&#20986;&#12377;</span>
    <span style="color: #fd971f;">thread_name</span>=<span style="color: #fa8072;">`echo "${line}" | awk -F"," '{print $2}'`</span>

    <span style="color: #465457;"># </span><span style="color: #465457;">&#12473;&#12524;&#12483;&#12489;ID&#12434;10&#36914;&#25968;&#12395;&#22793;&#25563;</span>
    <span style="color: #fd971f;">pid</span>=<span style="color: #fa8072;">`printf '%d\n' ${pid_hex}`</span>

    <span style="color: #465457;"># </span><span style="color: #465457;">/proc/&lt;pid&gt;/smaps &#12501;&#12449;&#12452;&#12523;&#12363;&#12425;&#12473;&#12479;&#12483;&#12463;&#12469;&#12452;&#12474;&#12289;&#12460;&#12540;&#12489;&#12506;&#12540;&#12472;&#12469;&#12452;&#12474;&#12434;&#21462;&#24471;&#12377;&#12427;</span>
    <span style="color: #fd971f;">guard_page</span>=<span style="color: #fa8072;">`cat /proc/$1/smaps | grep -B15 "stack:${pid}"| head -1 | awk '{print $2}'`</span>
    <span style="color: #fd971f;">stack_page</span>=<span style="color: #fa8072;">`cat /proc/$1/smaps | grep -A1 "stack:${pid}" | tail -1 | awk '{print $2}'`</span>
    <span style="color: #fd971f;">stack_size</span>=<span style="color: #fa8072;">`expr ${guard_page} + ${stack_page}`</span>
    <span style="color: #a6e22e;">printf</span> <span style="color: #e6db74;">"%7d\t%11s\t%12s\t%s\n"</span> <span style="color: #e6db74;">"${pid}"</span> <span style="color: #e6db74;">"${stack_size}Kb"</span> <span style="color: #e6db74;">"${guard_page}Kb"</span> <span style="color: #e6db74;">"${thread_name}"</span>
<span style="color: #f92672; font-weight: bold;">done</span>
</pre>
</div>

<p>
スタックサイズを明示的に指定して、サンプルを実行する。
</p>
<ul class="org-ul">
<li>-XX:ThreadStackSize=512
</li>
<li>-XX:VMThreadStackSize: 2048
</li>
<li>-XX:CompilerThreadStackSize=3072
</li>
</ul>
<pre class="example">
java -XX:VMThreadStackSize=2048 -XX:CompilerThreadStackSize=3072 -XX:ThreadStackSize=512 HelloWorld
Thread[Thread-0,5,main]: Hello World
Thread[Thread-4,5,main]: Hello World
Thread[Thread-1,5,main]: Hello World
Thread[Thread-3,5,main]: Hello World
Thread[Thread-2,5,main]: Hello World
★以降は省略
</pre>

<p>
測定結果
</p>
<pre class="example">
$ ./jvm_stacksize.sh `ps -ef | grep "[j]ava.*HelloWorld" | awk '{print $2}'`
[ PID ]	[StackSize]	[GuardPages]	[Thread Name]
  17285	     1048Kb	        12Kb	main
  17286	     2096Kb	         4Kb	GC task thread#0 (ParallelGC)
  17287	     2052Kb	         4Kb	GC task thread#1 (ParallelGC)
  17288	     2052Kb	         4Kb	GC task thread#2 (ParallelGC)
  17289	     2052Kb	         4Kb	GC task thread#3 (ParallelGC)
  17290	     2052Kb	         4Kb	VM Thread
  17291	    64584Kb	        12Kb	Reference Handler
  17292	      516Kb	        12Kb	Finalizer
  17293	      516Kb	        12Kb	Signal Dispatcher
  17294	     3076Kb	        12Kb	C2 CompilerThread0
  17295	     3076Kb	        12Kb	C2 CompilerThread1
  17296	      516Kb	        12Kb	Service Thread
  17297	     2052Kb	         4Kb	VM Periodic Task Thread
  17298	      516Kb	        12Kb	Thread-0
  17299	      516Kb	        12Kb	Thread-1
  17300	      516Kb	        12Kb	Thread-2
  17301	      516Kb	        12Kb	Thread-3
  17302	      516Kb	        12Kb	Thread-4
  17342	      516Kb	        12Kb	Attach Listener
</pre>

<p>
実測値はXXパラメータで指定した値より１ページ分多い。これは <code>glibc</code> 内部の
<a href="https://www.sourceware.org/git/gitweb.cgi?p=glibc.git;a=blob;f=nptl/allocatestack.c;h=8e620c46e9523092a5cf141e77f35c94dcfd9810;hb=HEAD#l349">allocate_stack</a> 処理で追加されているものです。
</p>
</div>
</div>
