blog/2015-04-22-[調査]jvmのスタックサイズについて.org
* ulimit -sの影響範囲
Linux環境に置いて、JVM内のスレッドは全てglibcの =pthread_create= 関数経由で起動される。
スレッド起動時にスタックサイズ明示的に指定していない場合、 =ulimit -s= で設定された値
がスタックのデフォルトサイズとして適用される。前文に書いた通りJVMはスレッド起動時に明
示的 =pthread_attr_setstacksize= 関数でXXパラメータ値の元にスタックサイズを指定してい
るため、これらのスレッドのスタックサイズは =ulimit -s= の値に影響されないだ。

ただし、JVMランチャー自身は =ulimit -s= の制限値が適用される。

=ulimit= コマンドでスタックの上限値 =RLIMIT_STACK= を64Kbを設定し、サンプルプログラム
グライムを実行すると、ランチャーのスタックサイズが60Kbで収まった。
#+begin_example
$ ulimit -s 64
$ java -Xss1024K -XX:VMThreadStackSize=2048 -XX:CompilerThreadStackSize=3072 -XX:ThreadStackSize=512 HelloWorld
Thread[Thread-1,5,main]: Hello World
Thread[Thread-3,5,main]: Hello World
Thread[Thread-0,5,main]: Hello World
Thread[Thread-2,5,main]: Hello World
Thread[Thread-4,5,main]: Hello World
★省略
#+end_example

=pmap= コマンドで仮想メモリマップの最上位アドレス近くにランチャーのスタックサイズを確
認することができる。
#+begin_example
$ pmap `ps -ef | grep "[j]ava.*HelloWorld" | awk '{print $2}'`
★省略
00007f39d068d000      4K r---- ld-2.17.so
00007f39d068e000      4K rw--- ld-2.17.so
00007f39d068f000      4K rw---   [ anon ]
00007fff7cf79000     60K rw---   [ stack ] ★ランチャーのスタックサイズ
00007fff7cffe000      8K r-x--   [ anon ]
ffffffffff600000      4K r-x--   [ anon ]
 total          3513684K
#+end_example

JVM内の各スレッドのスタックサイズは下記の通りです、 =RLIMIT_STACK= に影響されていない
ことが分かります。
#+begin_example
]$ ./jvm_stacksize.sh `ps -ef | grep "[j]ava.*HelloWorld" | awk '{print $2}'`
[ PID ]	[StackSize]	[GuardPages]	[Thread Name]
  10770	     1048Kb	        12Kb	main
  10771	     2096Kb	         4Kb	GC task thread#0 (ParallelGC)
  10772	     2052Kb	         4Kb	GC task thread#1 (ParallelGC)
  10773	     2052Kb	         4Kb	GC task thread#2 (ParallelGC)
  10774	     2052Kb	         4Kb	GC task thread#3 (ParallelGC)
  10775	    15812Kb	         4Kb	VM Thread
  10776	      516Kb	        12Kb	Reference Handler
  10777	    63556Kb	        12Kb	Finalizer
  10778	      516Kb	        12Kb	Signal Dispatcher
  10779	     3076Kb	        12Kb	C2 CompilerThread0
  10780	     3076Kb	        12Kb	C2 CompilerThread1
  10781	      516Kb	        12Kb	Service Thread
  10782	     2052Kb	         4Kb	VM Periodic Task Thread
  10783	      516Kb	        12Kb	Thread-0
  10784	      516Kb	        12Kb	Thread-1
  10785	      516Kb	        12Kb	Thread-2
  10786	      516Kb	        12Kb	Thread-3
  10787	      516Kb	        12Kb	Thread-4
  11203	      516Kb	        12Kb	Attach Listener
#+end_example

* -Xssと-XX:ThreadStackSizeの違い

=-Xss= と =-XX:ThreadStackSize= 両方ともJavaスレッドのスタックを指定するパラメータで
ある。 ただし、JVMランチャーから起動されたイニシャルスレッドのスタックサイズの制御は
=-Xss= パラメータのみできる。

以下はJVMランチャーからイニシャルスレッド起動するまでの流れ
#+begin_example
行
 | ★ランチャーの実行
1| openjdk/jdk/src/share/bin/main.c:93           ==> int main(int, char **);
2| openjdk/jdk/src/share/bin/java.c:170            ==> int JLI_Launch(int, char **, int, const char **, int, const char **, const char *, const char *, const char *, const char *, jboolean, jboolean, jboolean, jint);
3| openjdk/jdk/src/share/bin/java.c:1835             ==> int ContinueInNewThread(InvocationFunctions *, jlong, int, char **, int, char *, int);
 | ★イニシャルスレッド起動
4| openjdk/jdk/src/solaris/bin/java_md_solinux.c:1021  ==> int ContinueInNewThread0(int (JNICALL *continuation)(void *), jlong stack_size, void * args)
5| openjdk/jdk/src/share/bin/java.c:337                  ==> int JavaMain(void *);
 | openjdk/jdk/src/share/bin/java.c:1097                 ==> jboolean InitializeJVM(JavaVM **pvm, JNIEnv **penv, InvocationFunctions *ifn)
6| openjdk/hotspot/src/share/vm/prims/jni.cpp            ==> jint JNI_CreateJavaVM(JavaVM**, void**, void*);
7| openjdk/hotspot/src/share/vm/runtime/thread.cpp:3271    ==> jint Threads::create_vm(JavaVMInitArgs*, bool*);
8| openjdk/hotspot/src/os/linux/vm/os_linux.cpp:4898         ==> jint os::init_2(void)
9| openjdk/hotspot/src/os/linux/vm/os_linux.cpp:1205           ==> void os::Linux::capture_initial_stack(size_t max_size)
#+end_example

- 行1: JVMランチャーのmain関数
- 行2: =JLI_Launch= 関数にてコマンドラインパラメータのパーシング処理が実行される。
- 行3: =-Xss= パラメータが指定されていない場合、デフォルト値(1024Kb)を取得し(4)に渡す。
- 行4: glibcの =pthread_create= 関数を用いてイニシャルスレッドを起動する。 =-Xss= の
  値がスタックサイズに適用される。

=-Xss= と =-XX:ThreadStackSize= 片方指定する場合、と両方指定する場合効果が違うので要注意です。

|--------------------------+--------------------+----------------|
|                          | イニシャルスレッド | ワーカスレッド |
|--------------------------+--------------------+----------------|
| -Xss2048K                | 2048K              | 2048K          |
|--------------------------+--------------------+----------------|
| -XX:ThreadStackSize=2048 | 1024K              | 2048K          |
|--------------------------+--------------------+----------------|
| -Xss2048K                | 2048K              | 512K           |
| -XX:ThreadStackSize=512  |                    |                |
|--------------------------+--------------------+----------------|
